Revit 2027 API
HorizontalAlignmentStyle Enumeration
 Declares the horizontal alignment style of font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HorizontalAlignmentStyle
Public Enumeration HorizontalAlignmentStyle
public enum class HorizontalAlignmentStyle
type HorizontalAlignmentStyle
Members
Member name | Value | Description
Center | 1 |  Alignment to center
Left | 0 |  Alignment to left
Right | 2 |  Alignment to right
See Also
Reference
Autodesk.Revit.DB Namespace